Add project docs
